<template>
    <div class="content_box">
        <p>本网站旨在分享学习心得与资料。我深知个人隐私的重要性，并承诺会尊重并保护您的隐私。</p>
        <p>以下是关于本网站的隐私政策公告，请您仔细阅读。</p>
        <h1>关于本网站</h1>
        <p>本网站由我独立维护，主要记录我的学习历程和心得。</p>
        <p>网站内的所有资料均来源于互联网，经过我个人的整理、分析和总结得出。</p>
        <p>这些资料仅供学习之用，不具备任何商业性质。</p>
        <h1>隐私保护原则</h1>
        <p>我不会主动收集、存储或使用您的任何个人信息，除非您自愿提供（例如通过留言板、邮箱联系等方式）。</p>
        <p>如果您通过本网站提供的联系方式与我取得联系，我会妥善保管您的联系方式，并仅用于回复您的询问或建议，不会用于其他任何用途。</p>
        <p>我不会将您的个人信息泄露给任何第三方，除非法律要求我这样做。</p>
        <p>我将采取必要的技术和管理措施，确保您的个人信息在收集、传输、处理和存储过程中的安全性。</p>
        <h1>关于网站内容的使用</h1>
        <p>本网站的内容旨在帮助学习者，但请注意，这些内容仅代表我个人的观点和理解，可能并不完全准确或完整。因此，您在使用这些内容时，请务必自行判断其准确性和适用性。</p>
        <p>我明确禁止任何人以任何形式（包括商业和非商业）对网站内的内容进行传播、推广或盈利。对于网站内的原创内容，仅供您个人学习使用，不得进行任何形式的复制、转载或分享。</p>
        <p>如果您发现有人违反此规定，请立即向我举报，我将尽快采取必要的措施。</p>
        <h1>关于数据处理</h1>
        <h2>评论</h2>
        <p>当您在本网站上留下评论时，我会收集评论表单所显示的数据，以及您的IP地址和浏览器的User-Agent字符串，以帮助我检查垃圾评论。</p>
        <h2>媒体文件</h2>
        <p>如果您上传图片或其他媒体文件到本网站，请避免包含嵌入的地理位置信息（EXIF GPS）。本网站的访客可能能够下载并提取这些文件中的位置信息。</p>
        <h2>Cookies</h2>
        <p>为了提供更好的用户体验，本网站可能会使用Cookies。例如，当您发表评论时，我可以使用Cookies来记住您的名字和电子邮箱地址，以便您下次评论时不必再次填写。</p>
        <h2>嵌入内容</h2>
        <p>本网站的文章可能包含来自其他网站的嵌入内容。这些外部网站可能会收集您的数据、使用Cookies，并可能跟踪您与这些嵌入内容的交互。请注意，我无法控制这些外部网站的行为。</p>
        <h2>信息共享与存储</h2>
        <p>我不会无故与第三方共享您的个人信息，除非是为了满足法律要求或出于网站管理的需要。</p>
        <p>我将长期保存您的评论和元数据，以便识别并自动批准您的后续评论。</p>
        <h1>您的权利</h1>
        <p>您可以随时请求查看、编辑或删除我在网站上存储的关于您的个人信息。如果您希望删除或修改您的信息，请通过我的联系方式与我取得联系。</p>
        <h1>隐私政策的更新与修改</h1>
        <p>我可能会根据实际情况对隐私政策进行更新或修改。</p>
        <p>当隐私政策发生变动时，我会在网站上及时发布更新后的隐私政策，并通过适当的方式通知您。请您定期查看隐私政策，以了解最新的隐私保护措施。</p>
        <p>如果您对本网站的隐私政策有任何疑问或建议，请随时通过我的联系方式与我取得联系。我将尽快回复您，并为您提供帮助。</p>
        <p>再次感谢您的信任与支持。</p>
        <h2>特此公告</h2>
        <p>日期：2024年4月4日</p>
    </div>
</template>

<script lang='ts'>
export default {
    setup() {
        return {
        }
    }
}
</script>

<style scoped>
.content_box{
    text-align:center;
    color: var(--systemColor);
}
h1 h2{
    margin: 20px 0;
}
</style>