<template>
    <div class="content_box">
        <p>以下是关于本网站的公告，请仔细阅读。</p>
        <h2>关于本网站</h2>
        <p>本网站由我（Wen Jiang）独立开发与维护，主要记录我的学习历程和心得</p>
        <p>网站内的所有资料均来源于互联网，经过我个人的整理、分析和总结得出</p>
        <p>这些资料仅供学习记录之用，不具备任何商业性质，如果有涉及侵权之处，请及时与我联系</p>
        <h2>关于网站内容的使用</h2>
        <p>本网站的内容仅代表我个人的观点和理解，可能并不完全准确或完整。因此，在使用这些内容时，请务必自行判断其准确性和适用性</p>
        <p>我明确禁止任何人以任何形式（包括商业和非商业）对网站内的内容进行传播、推广或盈利</p>
        <p>对于网站内的原创内容，仅供个人学习使用，不得进行任何形式的恶意复制、转载或分享</p>
        <p>如果发现有人违反此规定，我将采取必要的措施</p>
        <h2>关于数据处理</h2>
        <p>本网站可能包含来自其他网站的嵌入内容。这些外部网站可能会收集您的数据、使用Cookies，并可能跟踪您与这些嵌入内容的交互。请注意，我无法控制这些外部网站的行为</p>
        <p>特此公告</p>
        <p>更新日期：2024年4月4日</p>
    </div>
</template>

<script lang='ts'>
export default {
    setup() {
        return {
        }
    }
}
</script>

<style scoped>
.content_box{
    text-align:center;
    color: var(--systemColor);
}
h1 h2{
    margin: 20px 0;
}
</style>